results/out/undertow.ring-middleware.sync.java17.G1GC.r10k.t16.c400.d600s.out
Running 10m test @ http://localhost:9999/math/plus?x=1&y=2
  16 threads and 400 connections
  Thread calibration: mean lat.: 2.541ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.376ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.924ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 2.400ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.623ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.380ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.730ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 2.583ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.496ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.555ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.724ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 2.600ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.638ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 2.650ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 2.565ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.316ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.64ms    2.03ms  29.52ms   81.52%
    Req/Sec   658.29    543.74     2.27k    56.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.98ms
 75.000%    3.37ms
 90.000%    5.49ms
 99.000%    9.69ms
 99.900%   12.76ms
 99.990%   16.31ms
 99.999%   21.38ms
100.000%   29.53ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.071     0.000000            2         1.00
       0.815     0.100000       591292         1.11
       1.114     0.200000      1181039         1.25
       1.369     0.300000      1770793         1.43
       1.646     0.400000      2359901         1.67
       1.980     0.500000      2950080         2.00
       2.181     0.550000      3245713         2.22
       2.415     0.600000      3541020         2.50
       2.685     0.650000      3835546         2.86
       2.997     0.700000      4129365         3.33
       3.369     0.750000      4424048         4.00
       3.587     0.775000      4571700         4.44
       3.841     0.800000      4719040         5.00
       4.135     0.825000      4867541         5.71
       4.487     0.850000      5014120         6.67
       4.935     0.875000      5161466         8.00
       5.199     0.887500      5235387         8.89
       5.487     0.900000      5308737        10.00
       5.807     0.912500      5382910        11.43
       6.163     0.925000      5456928        13.33
       6.551     0.937500      5530487        16.00
       6.763     0.943750      5567015        17.78
       6.991     0.950000      5603734        20.00
       7.243     0.956250      5640725        22.86
       7.515     0.962500      5677488        26.67
       7.835     0.968750      5714618        32.00
       8.015     0.971875      5733026        35.56
       8.207     0.975000      5751174        40.00
       8.431     0.978125      5770059        45.71
       8.679     0.981250      5788243        53.33
       8.975     0.984375      5806887        64.00
       9.143     0.985938      5816032        71.11
       9.327     0.987500      5824989        80.00
       9.543     0.989062      5834144        91.43
       9.791     0.990625      5843287       106.67
      10.087     0.992188      5852604       128.00
      10.247     0.992969      5857125       142.22
      10.431     0.993750      5861872       160.00
      10.623     0.994531      5866475       182.86
      10.839     0.995313      5871034       213.33
      11.095     0.996094      5875673       256.00
      11.239     0.996484      5877944       284.44
      11.383     0.996875      5880150       320.00
      11.559     0.997266      5882469       365.71
      11.767     0.997656      5884845       426.67
      11.975     0.998047      5887095       512.00
      12.095     0.998242      5888219       568.89
      12.231     0.998437      5889379       640.00
      12.383     0.998633      5890523       731.43
      12.567     0.998828      5891682       853.33
      12.791     0.999023      5892843      1024.00
      12.911     0.999121      5893406      1137.78
      13.063     0.999219      5893995      1280.00
      13.223     0.999316      5894557      1462.86
      13.439     0.999414      5895124      1706.67
      13.735     0.999512      5895713      2048.00
      13.895     0.999561      5895988      2275.56
      14.127     0.999609      5896280      2560.00
      14.367     0.999658      5896566      2925.71
      14.647     0.999707      5896858      3413.33
      14.983     0.999756      5897145      4096.00
      15.135     0.999780      5897286      4551.11
      15.327     0.999805      5897434      5120.00
      15.535     0.999829      5897571      5851.43
      15.775     0.999854      5897715      6826.67
      16.039     0.999878      5897861      8192.00
      16.207     0.999890      5897932      9102.22
      16.343     0.999902      5898003     10240.00
      16.559     0.999915      5898077     11702.86
      16.799     0.999927      5898153     13653.33
      17.103     0.999939      5898219     16384.00
      17.279     0.999945      5898258     18204.44
      17.503     0.999951      5898292     20480.00
      17.791     0.999957      5898328     23405.71
      18.015     0.999963      5898363     27306.67
      18.335     0.999969      5898399     32768.00
      18.607     0.999973      5898419     36408.89
      18.879     0.999976      5898436     40960.00
      19.215     0.999979      5898454     46811.43
      19.471     0.999982      5898471     54613.33
      20.127     0.999985      5898490     65536.00
      20.303     0.999986      5898498     72817.78
      20.687     0.999988      5898507     81920.00
      21.215     0.999989      5898516     93622.86
      21.439     0.999991      5898525    109226.67
      22.223     0.999992      5898534    131072.00
      22.671     0.999993      5898539    145635.56
      22.895     0.999994      5898543    163840.00
      23.391     0.999995      5898549    187245.71
      23.487     0.999995      5898552    218453.33
      24.079     0.999996      5898558    262144.00
      24.399     0.999997      5898559    291271.11
      24.607     0.999997      5898561    327680.00
      24.895     0.999997      5898564    374491.43
      25.135     0.999998      5898566    436906.67
      25.839     0.999998      5898568    524288.00
      25.903     0.999998      5898569    582542.22
      26.143     0.999998      5898570    655360.00
      26.287     0.999999      5898572    748982.86
      26.319     0.999999      5898573    873813.33
      26.351     0.999999      5898574   1048576.00
      26.351     0.999999      5898574   1165084.44
      26.479     0.999999      5898575   1310720.00
      26.511     0.999999      5898576   1497965.71
      26.511     0.999999      5898576   1747626.67
      26.879     1.000000      5898577   2097152.00
      26.879     1.000000      5898577   2330168.89
      26.879     1.000000      5898577   2621440.00
      27.055     1.000000      5898578   2995931.43
      27.055     1.000000      5898578   3495253.33
      27.055     1.000000      5898578   4194304.00
      27.055     1.000000      5898578   4660337.78
      27.055     1.000000      5898578   5242880.00
      29.535     1.000000      5898579   5991862.86
      29.535     1.000000      5898579          inf
#[Mean    =        2.635, StdDeviation   =        2.032]
#[Max     =       29.520, Total count    =      5898579]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5998230 requests in 10.00m, 0.88GB read
Requests/sec:   9997.02
Transfer/sec:      1.51MB